var APP_DATA = {
  "scenes": [
    {
      "id": "0-vr1",
      "name": "vr1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": 0,
        "pitch": 0,
        "fov": 1.1938631847205923
      },
      "linkHotspots": [
        {
          "yaw": -2.9799739817715025,
          "pitch": 0.08091203709706818,
          "rotation": 0,
          "target": "1-vr4"
        },
        {
          "yaw": 0.9120316282273428,
          "pitch": -0.00532077301208389,
          "rotation": 0,
          "target": "10-vr12"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-vr4",
      "name": "vr4",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.41428503137430184,
          "pitch": 0.05955438418354042,
          "rotation": 0,
          "target": "2-vr5"
        },
        {
          "yaw": -2.822527775342543,
          "pitch": 0.29247763046386765,
          "rotation": 0,
          "target": "0-vr1"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.7194470147404708,
          "pitch": -0.036369946574614787,
          "title": "تمثال الملك منكاورع",
          "text": "هو ملك مصري من الأسرة الرابعة خلال عصر الدولة القديمة. ابن الملك خفرع ، ملكا مصر. واسمه يعني: «فلتبقى كاءاته مثل رع». تزوج من الأميرة خعمررنبتي الثانية. عثر في المعبد الجنائزى لمنكاورع على سكين من حجر الصوان منقوش عليه اسم والدة الملك وتدعى خعمررنبتي الأولى، فيما يشير إلى أن خفرع وهذه الملكة هما والدا منكاورع. ويعتقد أن منكاورع كان لديه زوجتان•"
        }
      ]
    },
    {
      "id": "2-vr5",
      "name": "vr5",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.0954221907393809,
          "pitch": 0.20961573049874715,
          "rotation": 0,
          "target": "3-vr6"
        },
        {
          "yaw": -2.116005537642966,
          "pitch": 0.18282476759978827,
          "rotation": 0,
          "target": "1-vr4"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.6198231210507963,
          "pitch": 0.08885773484225012,
          "title": "تمثال الملك منكاورع",
          "text": "هو ملك مصري من الأسرة الرابعة خلال عصر الدولة القديمة. ابن الملك خفرع ، ملكا مصر. واسمه يعني: «فلتبقى كاءاته مثل رع». تزوج من الأميرة خعمررنبتي الثانية. عثر في المعبد الجنائزى لمنكاورع على سكين من حجر الصوان منقوش عليه اسم والدة الملك وتدعى خعمررنبتي الأولى، فيما يشير إلى أن خفرع وهذه الملكة هما والدا منكاورع. ويعتقد أن منكاورع كان لديه زوجتان•"
        },
        {
          "yaw": -0.023298416942374445,
          "pitch": -0.22894986491368563,
          "title": "تمثال خفرع",
          "text": "<div>يصور هذا التمثال الملك خفرع، باني ثاني أكبر هرم في الجيزة. تم العثور عليه في معبد الوادي من المجموعة الهرمية، يجلس الملك على العرش بكل ثقة وتم تزيين جانبي عرشه برسم سما تاوي، رمز وحدة مصر العليا والسفلى، مما يدل على حكمه على كل البلاد. يقف الإله حورس بهيئة الصقر على ظهر العرش، خلف رأس الملك، ويفرد جناحيه حول الملك كرمز للحماية.</div><div>الدولة القديمة ، الأسرة الرابعة ، عهد خفرع (حوالي 2555 - 2532 ق.م.)</div><div>مادة الصنع :الديوريت</div><div>مكان العثور :الجيزة</div>"
        }
      ]
    },
    {
      "id": "3-vr6",
      "name": "vr6",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.26120611363919366,
          "pitch": 0.11046902623715837,
          "rotation": 0,
          "target": "4-vr7"
        },
        {
          "yaw": -2.9846887336358314,
          "pitch": 0.2941676378825786,
          "rotation": 0,
          "target": "2-vr5"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.167387790790281,
          "pitch": 0.3919374764346433,
          "title": "تمثال جالس",
          "text": "تمثال جالس من الاسرة الحاكمة"
        }
      ]
    },
    {
      "id": "4-vr7",
      "name": "vr7",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.192570681928748,
          "pitch": 0.09277107123190476,
          "rotation": 0,
          "target": "5-vr8"
        },
        {
          "yaw": -2.2821035522480386,
          "pitch": 0.2518542242818693,
          "rotation": 0,
          "target": "3-vr6"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.1404597284710825,
          "pitch": 0.24245384197843656,
          "title": "تمثال جالس",
          "text": "تمثال جالس من الاسرة الحاكمة"
        }
      ]
    },
    {
      "id": "5-vr8",
      "name": "vr8",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1415,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.4686538543799834,
          "pitch": 0.3327127803679488,
          "rotation": 0,
          "target": "4-vr7"
        },
        {
          "yaw": -0.8431165235867333,
          "pitch": -0.03641913985448575,
          "rotation": 0,
          "target": "6-vr81"
        },
        {
          "yaw": 3.0533900490342063,
          "pitch": -0.002674712875368357,
          "rotation": 0,
          "target": "7-vr9"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.05491744965928014,
          "pitch": -0.05485026775279067,
          "title": "تمثال جماعي لأمنحتب الثالث مع الملكة تاي وبناته",
          "text": "<div>من مدينة هابو، تمثال جماعيضخم يضم الملك أمنحتب الثالث وزوجته الملكة تاي وبناته عند قدميهما بحجم صغير ، ويصور الملك أمنحتب وهو يرتدي الشنديد الملكي والنمس الملكي يحليه الصل الملكي واللحية المستعارة المستقيمة ويضع يديه على ركبتيه ويظهر بجسد رشيق رياضي ورأس التمثال فى حالة جيدة من الخفظ.</div><div>بينما تظهر من جانبه \"تاي\" وهي ترتدي رداء حابط طويل لا يظهر منه سوى قدميها وباروكة شعر متناسقة يحليها الصل الملكي وتضع يدها اليمنى على ركبتيها بينما اليسرى تحيط بها زوجها فى محبة وحنان وبين أقدامهما تظهر ثلاث من بناته كهيئة أمهن ولكن بحجم أصغر ونجد أن الفنان قد أجاد فى نحت كل من الملك والملك واللذين تظهر ابتسامة خفيفة على وجهيهما..والتمثال أصابه بعض التلف وخاصة فى هيئات بنات الملك.</div>"
        }
      ]
    },
    {
      "id": "6-vr81",
      "name": "vr8.1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1415,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.1182284664521589,
          "pitch": 0.09803299531986376,
          "rotation": 0,
          "target": "5-vr8"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "7-vr9",
      "name": "vr9",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1415,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -3.1390197107309277,
          "pitch": -0.2964755034397264,
          "rotation": 0,
          "target": "5-vr8"
        },
        {
          "yaw": -0.04572337687638495,
          "pitch": 0.11322587897808489,
          "rotation": 0,
          "target": "8-vr10"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "8-vr10",
      "name": "vr10",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1415,
      "initialViewParameters": {
        "yaw": 0,
        "pitch": 0,
        "fov": 1.1938631847205923
      },
      "linkHotspots": [
        {
          "yaw": 2.7764805952774108,
          "pitch": -0.1972661667194906,
          "rotation": 0,
          "target": "7-vr9"
        },
        {
          "yaw": 0.12009170146672332,
          "pitch": 0.1719046416940202,
          "rotation": 0,
          "target": "9-vr11"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.625672285284809,
          "pitch": 0.09995320006907882,
          "title": "&nbsp;تمثال مقطوع الرأس لأمنحتب الثالث",
          "text": "Text"
        }
      ]
    },
    {
      "id": "9-vr11",
      "name": "vr11",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1415,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.5569023944001437,
          "pitch": 0.06924947363147638,
          "rotation": 0,
          "target": "8-vr10"
        },
        {
          "yaw": -2.0877462548823367,
          "pitch": 0.033945561984296546,
          "rotation": 0,
          "target": "10-vr12"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.0930757822686736,
          "pitch": -0.08682606673968785,
          "title": "تمثال واقف لإخناتون",
          "text": "<div>أكتشف هذا التمثال فى الكرنك ويبدو فيه بوضوح أهم ملامح فن العمارنة وأفكار إخناتون فى الفن وهي الواقعية مع كثير من المبالغة والتركيز على إظهار الجسد فى هيئة مترهلة ببطن منتفخة وأثداء مترهلة وجسد سمين ممتلىء تشبهاً بتماثيل الإله حعبي رب النيل التي يظهر فيها بهذه الهيئة</div><div>دلالة على الخصوبة والوفرة .</div><div>وأيضاً إظهار التماثيل العارية أحادية الجنس(والتي لا يعلم كنهها أذكراً كانت أم أنثى) وهو مايتضح بشدة فى هذا التمثال، ونجد وضع خراطيش الملك على بطن وصدر الملك،والتمثال أصابه التلف فى منطقة الرأس وباقي أجزاء التمثال.</div>"
        },
        {
          "yaw": -1.4138048855084193,
          "pitch": -0.037480413635876175,
          "title": "جزء من تمثال لإخناتون",
          "text": "<div>أكتشف هذا التمثال فى معبد الكرنك وبالطبع هذا التمثال ينتمي للسنين الأولى من حكم الملك قبل أن ينتقل للعمارنة،ومع ذلك نلمح فيه تأثيرات من باكورة فن العمارنة</div><div>نجد الملك هنا فى الهيئة الأوزيرية المميزة بتقاطع الأيدي على الصدر ويمسك بيده المذبة الملكية(نخخ) والصولجان(حقا) ويرتدي التاج المزدوج واللحية الملكية إلا أن وجه الملك المميز المسحوب الطويل ذو الأنف الرفيع والشفاه الغليظة الممتلئة والوجنتين الشاحبتين وكذلك تحديد العيون اللوزية المسحوبة التي تبدو كمالو كانت خطوط رسمت على الحجر مع شىء من الإتساع وتحديد للجفون كل ذلك يميز وجه الملك ذو الملامح الواقعية البسيطة.</div>"
        }
      ]
    },
    {
      "id": "10-vr12",
      "name": "vr12",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1344,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.39128635395650235,
          "pitch": 0.09098134206957553,
          "rotation": 0,
          "target": "0-vr1"
        },
        {
          "yaw": 2.4722328340343624,
          "pitch": 0.2921472912242997,
          "rotation": 0,
          "target": "9-vr11"
        }
      ],
      "infoHotspots": []
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "qtvr",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
